### Join
### 一对一Join

In [11]:
import pandas as pd 
df1 = pd.DataFrame({'Employee':['Bob','Jake','Lisa','Tome','Creator'],
                   'Group':['Accounting','Engineering','ProjectManager','HumanResource','VicePredisent']})
df1

  Employee           Group
0      Bob      Accounting
1     Jake     Engineering
2     Lisa  ProjectManager
3     Tome   HumanResource
4  Creator   VicePredisent

In [31]:
df2 = pd.DataFrame({'Employee':['Bob','Jake','Lisa','Tome','Creator'],
                   'Salary':[2002,2012,2029,2013,3022]})
df2

  Employee  Salary
0      Bob    2002
1     Jake    2012
2     Lisa    2029
3     Tome    2013
4  Creator    3022

In [32]:
df3 = pd.merge(df1,df2)
df3

  Employee           Group  Salary
0      Bob      Accounting    2002
1     Jake     Engineering    2012
2     Lisa  ProjectManager    2029
3     Tome   HumanResource    2013
4  Creator   VicePredisent    3022

## 多对一Join

In [35]:
df4 = pd.DataFrame({'Group':['Engineering','ProjectManager','HumanResource'],
                   'Supervisor':['Calur','Heoms','Materin']})
df4

            Group Supervisor
0     Engineering      Calur
1  ProjectManager      Heoms
2   HumanResource    Materin

In [36]:
df5 = pd.merge(df3,df4)
df5

  Employee           Group  Salary Supervisor
0     Jake     Engineering    2012      Calur
1     Lisa  ProjectManager    2029      Heoms
2     Tome   HumanResource    2013    Materin

In [38]:
df5 = pd.merge(df4,df3)
df5

            Group Supervisor Employee  Salary
0     Engineering      Calur     Jake    2012
1  ProjectManager      Heoms     Lisa    2029
2   HumanResource    Materin     Tome    2013

### 多对多Join

In [46]:
df5 = pd.DataFrame({'Group':['Accounting', 'Accounting','Engineering',
                             'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 
                               'linux', 'spreadsheets', 'organization']})
df5

         Group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [47]:
pd.merge(df4,df5)

         Group Supervisor  skills
0  Engineering      Calur  coding
1  Engineering      Calur   linux